Model: "wct"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 256, 256, 64) 1792        input_2[0][0]                    
__________________________________________________________________________________________________
block1_conv2_encode (Conv2D)    (None, 256, 256, 64) 36928       block1_conv1[1][0]               
__________________________________________________________________________________________________
block1_conv2 (WaveLetPooling)   [(None, 128, 128, 64 0           block1_conv2_encode[0][0]        
__________________________________________________________________________________________________
block2_conv1_encode (Conv2D)    (None, 128, 128, 128 73856       block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv2_encode (Conv2D)    (None, 128, 128, 128 147584      block2_conv1_encode[0][0]        
__________________________________________________________________________________________________
block2_conv2 (WaveLetPooling)   [(None, 64, 64, 128) 0           block2_conv2_encode[0][0]        
__________________________________________________________________________________________________
block3_conv1_encode (Conv2D)    (None, 64, 64, 256)  295168      block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv2_encode (Conv2D)    (None, 64, 64, 256)  590080      block3_conv1_encode[0][0]        
__________________________________________________________________________________________________
block3_conv3_encode (Conv2D)    (None, 64, 64, 256)  590080      block3_conv2_encode[0][0]        
__________________________________________________________________________________________________
block3_conv4_encode (Conv2D)    (None, 64, 64, 256)  590080      block3_conv3_encode[0][0]        
__________________________________________________________________________________________________
block3_conv4 (WaveLetPooling)   [(None, 32, 32, 256) 0           block3_conv4_encode[0][0]        
__________________________________________________________________________________________________
block4_conv1_encode (Conv2D)    (None, 32, 32, 512)  1180160     block3_conv4[0][0]               
__________________________________________________________________________________________________
block4_conv1_decode (Conv2D)    (None, 32, 32, 256)  1179904     block4_conv1_encode[0][0]        
__________________________________________________________________________________________________
block4_conv1 (WaveLetUnPooling) (None, 64, 64, 1280) 0           block4_conv1_decode[0][0]        
                                                                 block4_conv1_decode[0][0]        
                                                                 block4_conv1_decode[0][0]        
                                                                 block4_conv1_decode[0][0]        
                                                                 block3_conv4_encode[0][0]        
__________________________________________________________________________________________________
block3_conv4_decode (Conv2D)    (None, 64, 64, 256)  2949376     block4_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3_decode (Conv2D)    (None, 64, 64, 256)  590080      block3_conv4_decode[0][0]        
__________________________________________________________________________________________________
block3_conv2_decode (Conv2D)    (None, 64, 64, 256)  590080      block3_conv3_decode[0][0]        
__________________________________________________________________________________________________
block3_conv1_decode (Conv2D)    (None, 64, 64, 128)  295040      block3_conv2_decode[0][0]        
__________________________________________________________________________________________________
block3_conv1 (WaveLetUnPooling) (None, 128, 128, 640 0           block3_conv1_decode[0][0]        
                                                                 block3_conv1_decode[0][0]        
                                                                 block3_conv1_decode[0][0]        
                                                                 block3_conv1_decode[0][0]        
                                                                 block2_conv2_encode[0][0]        
__________________________________________________________________________________________________
block2_conv2_decode (Conv2D)    (None, 128, 128, 128 737408      block3_conv1[0][0]               
__________________________________________________________________________________________________
block2_conv1_decode (Conv2D)    (None, 128, 128, 64) 73792       block2_conv2_decode[0][0]        
__________________________________________________________________________________________________
block2_conv1 (WaveLetUnPooling) (None, 256, 256, 320 0           block2_conv1_decode[0][0]        
                                                                 block2_conv1_decode[0][0]        
                                                                 block2_conv1_decode[0][0]        
                                                                 block2_conv1_decode[0][0]        
                                                                 block1_conv2_encode[0][0]        
__________________________________________________________________________________________________
block1_conv2_decode (Conv2D)    (None, 256, 256, 64) 184384      block2_conv1[0][0]               
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 3)  1731        block1_conv2_decode[0][0]        
==================================================================================================
Total params: 10,107,523
Trainable params: 6,601,795
Non-trainable params: 3,505,728